<a href="https://colab.research.google.com/github/jpablofdez/DataScience/blob/master/Tarea2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Tarea #2

In [0]:
import pandas as pd
import numpy as np

In [0]:
datos = pd.read_csv('CompraBicicletas.csv',sep=';')
#datos = datos.drop(['RowNumber','CustomerId','Surname'], axis=1)

In [15]:
datos.head()

      ID MaritalStatus  Gender  ...   Region  Age PurchasedBike
0  12496       Married  Female  ...   Europe   42            No
1  24107       Married    Male  ...   Europe   43            No
2  14177       Married    Male  ...   Europe   60            No
3  24381        Single    Male  ...  Pacific   41           Yes
4  25597        Single    Male  ...   Europe   36           Yes

[5 rows x 13 columns]

In [16]:
datos.describe()

                 ID         Income     Children         Cars          Age
count   1000.000000    1000.000000  1000.000000  1000.000000  1000.000000
mean   19965.992000   56140.000000     1.908000     1.452000    44.190000
std     5347.333948   31081.609779     1.626094     1.124705    11.353537
min    11000.000000   10000.000000     0.000000     0.000000    25.000000
25%    15290.750000   30000.000000     0.000000     1.000000    35.000000
50%    19744.000000   60000.000000     2.000000     1.000000    43.000000
75%    24470.750000   70000.000000     3.000000     2.000000    52.000000
max    29447.000000  170000.000000     5.000000     4.000000    89.000000

In [19]:
 datos['Income'].describe()

count      1000.000000
mean      56140.000000
std       31081.609779
min       10000.000000
25%       30000.000000
50%       60000.000000
75%       70000.000000
max      170000.000000
Name: Income, dtype: float64

In [20]:
# percentile list 
perc =[.25] 
  
# list of dtypes to include 
include =['object', 'float', 'int'] 
datos['Income'].describe(percentiles = perc, include = include)

count      1000.000000
mean      56140.000000
std       31081.609779
min       10000.000000
25%       30000.000000
50%       60000.000000
max      170000.000000
Name: Income, dtype: float64